Repository: aziznizomofficial/kotiba
Catalog: Sources/KotibaUI/Resources/Localizable.xcstrings
Source language: en
Languages: ru, uz_cyrl, uz_latn

# home.blockers.checkAgain
source: Check again
ru: Проверить снова
uz_cyrl: Қайта текшириш
uz_latn: Qayta tekshirish

# home.blockers.checking
source: Checking…
ru: Проверяю…
uz_cyrl: Текширилмоқда…
uz_latn: Tekshirilmoqda…

# home.blockers.fix
source: Fix
ru: Исправить
uz_cyrl: Тузатиш
uz_latn: Tuzatish

# home.clipboardHint
source: No text field had focus, so your last dictation is on the clipboard — press ⌘V where you want it. It’s in History too.
ru: Ни одно поле ввода не было активно, поэтому последняя диктовка скопирована в буфер обмена — нажмите ⌘V там, где она нужна. Она есть и в истории.
uz_cyrl: Ҳеч бир матн майдони фаол эмас эди, шунинг учун сўнгги диктовка буферга нусхаланди — керакли жойда ⌘V ни босинг. У «Тарих»да ҳам бор.
uz_latn: Hech bir matn maydoni faol emas edi, shuning uchun soʻnggi diktovka buferga nusxalandi — kerakli joyda ⌘V ni bosing. U «Tarix»da ham bor.

# home.greeting.afternoon
source: Good afternoon
ru: Добрый день
uz_cyrl: Хайрли кун
uz_latn: Xayrli kun

# home.greeting.evening
source: Good evening
ru: Добрый вечер
uz_cyrl: Хайрли кеч
uz_latn: Xayrli kech

# home.greeting.morning
source: Good morning
ru: Доброе утро
uz_cyrl: Хайрли тонг
uz_latn: Xayrli tong

# home.hero.hold
source: Hold
ru: Удерживайте
uz_cyrl: Босиб туринг
uz_latn: Bosib turing

# home.hero.howTo
source: speak, let go — it’s typed where your cursor is.
ru: говорите, отпустите — текст появится там, где курсор.
uz_cyrl: гапиринг ва қўйиб юборинг — матн курсор турган жойга ёзилади.
uz_latn: gapiring va qoʻyib yuboring — matn kursor turgan joyga yoziladi.

# home.last.title
source: Last dictation
ru: Последняя диктовка
uz_cyrl: Сўнгги диктовка
uz_latn: Soʻnggi diktovka

# home.pickers.language
source: Language
ru: Язык
uz_cyrl: Тил
uz_latn: Til

# home.pickers.language.detail
source: Automatic works out which one you are speaking.
ru: «Автоматически» — Kotiba сама определит, на каком языке вы говорите.
uz_cyrl: «Автоматик» — қайси тилда гапираётганингизни Kotiba ўзи аниқлайди.
uz_latn: «Avtomatik» — qaysi tilda gapirayotganingizni Kotiba oʻzi aniqlaydi.

# home.pickers.mode
source: Mode
ru: Режим
uz_cyrl: Режим
uz_latn: Rejim

# home.pickers.mode.automatic
source: Automatic lets the app you are in choose.
ru: «Автоматически» — режим выбирается по приложению, в котором вы работаете.
uz_cyrl: «Автоматик» — режимни сиз ишлаётган илова танлайди.
uz_latn: «Avtomatik» — rejimni siz ishlayotgan ilova tanlaydi.

# home.pickers.mode.detail
source: What your dictation turns into.
ru: Во что превращается ваша диктовка.
uz_cyrl: Диктовкангиз нимага айланади.
uz_latn: Diktovkangiz nimaga aylanadi.

# home.quietMic.detail.builtIn
source: That is the Mac’s own microphone. Check its input level in Sound settings, or move closer.
ru: Это встроенный микрофон Mac. Проверьте уровень входа в настройках звука или подвиньтесь ближе.
uz_cyrl: Бу Mac нинг ўз микрофони. Товуш созламаларида кириш даражасини текширинг ёки яқинроқ келинг.
uz_latn: Bu Mac’ning oʻz mikrofoni. Tovush sozlamalarida kirish darajasini tekshiring yoki yaqinroq keling.

# home.quietMic.detail.continuity
source: That looks like an iPhone (Continuity) microphone, which is easy to pick up by accident. If it isn’t next to you, choose the Mac’s own microphone in Sound settings.
ru: Похоже, это микрофон iPhone (Continuity) — его легко включить случайно. Если iPhone не рядом, выберите встроенный микрофон Mac в настройках звука.
uz_cyrl: Бу iPhone (Continuity) микрофонига ўхшайди — уни тасодифан танлаб қўйиш осон. iPhone ёнингизда бўлмаса, товуш созламаларида Mac нинг ўз микрофонини танланг.
uz_latn: Bu iPhone (Continuity) mikrofoniga oʻxshaydi — uni tasodifan tanlab qoʻyish oson. iPhone yoningizda boʻlmasa, tovush sozlamalarida Mac’ning oʻz mikrofonini tanlang.

# home.quietMic.detail.external
source: That is not the Mac’s own microphone. If you did not mean to use it, choose another input in Sound settings.
ru: Это не встроенный микрофон Mac. Если вы не хотели его использовать, выберите другой вход в настройках звука.
uz_cyrl: Бу Mac нинг ўз микрофони эмас. Уни ишлатмоқчи бўлмасангиз, товуш созламаларида бошқа киришни танланг.
uz_latn: Bu Mac’ning oʻz mikrofoni emas. Uni ishlatmoqchi boʻlmasangiz, tovush sozlamalarida boshqa kirishni tanlang.

# home.quietMic.open
source: Open Sound settings
ru: Открыть настройки звука
uz_cyrl: Товуш созламаларини очиш
uz_latn: Tovush sozlamalarini ochish

# home.quietMic.title
source: Kotiba hears almost nothing from “%@”
ru: Kotiba почти ничего не слышит с «%@»
uz_cyrl: Kotiba «%@» дан деярли ҳеч нарса эшитмаяпти
uz_latn: Kotiba «%@» dan deyarli hech narsa eshitmayapti

# home.today.latency
source: Key-up to text
ru: Задержка
uz_cyrl: Тугмадан матнгача
uz_latn: Tugmadan matngacha

# home.today.open
source: Open Statistics
ru: Открыть статистику
uz_cyrl: Статистикани очиш
uz_latn: Statistikani ochish

# home.today.streak
source: Streak
ru: Серия
uz_cyrl: Кетма-кет
uz_latn: Ketma-ket

# home.today.title
source: Today
ru: Сегодня
uz_cyrl: Бугун
uz_latn: Bugun

# home.today.words
source: Words today
ru: Слов сегодня
uz_cyrl: Бугунги сўзлар
uz_latn: Bugungi soʻzlar

# home.today.words.caption
source: typed for you
ru: набрано за вас
uz_cyrl: сиз учун ёзилди
uz_latn: siz uchun yozildi

# hotkey.advice.accessibility
source: Needs Accessibility as well as Input Monitoring: Kotiba has to swallow the key so holding it types nothing.
ru: Нужен «Универсальный доступ» в дополнение к «Мониторингу ввода»: Kotiba должна перехватывать клавишу, чтобы при удержании она ничего не печатала.
uz_cyrl: «Киритишни кузатиш»дан ташқари «Махсус имкониятлар» ҳам керак: босиб турилганда тугма ҳеч нарса ёзмаслиги учун Kotiba уни ушлаб қолиши керак.
uz_latn: «Kiritishni kuzatish»dan tashqari «Maxsus imkoniyatlar» ham kerak: bosib turilganda tugma hech narsa yozmasligi uchun Kotiba uni ushlab qolishi kerak.

# hotkey.advice.globe
source: macOS also uses 🌐. Set System Settings › Keyboard › “Press 🌐 key to” to “Do Nothing”, or the emoji picker or Apple Dictation will open too.
ru: macOS тоже использует 🌐. В «Системных настройках» › «Клавиатура» для параметра «Нажатие клавиши 🌐» выберите «Ничего не делать», иначе заодно будут открываться эмодзи или Диктовка Apple.
uz_cyrl: macOS ҳам 🌐 тугмасидан фойдаланади. «Тизим созламалари» › «Клавиатура» бўлимида «🌐 тугмаси босилганда» параметрини «Ҳеч нарса қилмаслик»ка ўрнатинг, акс ҳолда эмоджи ойнаси ёки Apple диктовкаси ҳам очилади.
uz_latn: macOS ham 🌐 tugmasidan foydalanadi. «Tizim sozlamalari» › «Klaviatura» boʻlimida «🌐 tugmasi bosilganda» parametrini «Hech narsa qilmaslik»ka oʻrnating, aks holda emoji oynasi yoki Apple diktovkasi ham ochiladi.

# hotkey.advice.leftHand
source: Most shortcuts use the left %@. Every shortcut starts a dictation that is cancelled a moment later — the right-hand key avoids that.
ru: Большинство сочетаний клавиш используют левый %@. Каждое такое сочетание запускает диктовку, которая тут же отменяется, — клавиша справа этого избегает.
uz_cyrl: Кўпчилик тугмалар бирикмаси чап %@ дан фойдаланади. Ҳар бир шундай бирикма бир зумда бекор қилинадиган диктовкани бошлаб юборади — ўнг томондаги тугма бундан холи.
uz_latn: Koʻpchilik tugmalar birikmasi chap %@ dan foydalanadi. Har bir shunday birikma bir zumda bekor qilinadigan diktovkani boshlab yuboradi — oʻng tomondagi tugma bundan xoli.

# hotkey.advice.mediaKeys
source: F1–F12 are media keys on Mac keyboards unless “Use F1, F2, etc. keys as standard function keys” is on; held with fn they always work.
ru: На клавиатурах Mac F1–F12 — медиаклавиши, если не включён параметр «Использовать F1, F2 и т. д. как стандартные функциональные клавиши»; вместе с fn они работают всегда.
uz_cyrl: Mac клавиатураларида F1–F12 медиа тугмалардир, агар «F1, F2 ва ҳоказо тугмалардан стандарт функционал тугмалар сифатида фойдаланиш» ёқилмаган бўлса; fn билан бирга улар доим ишлайди.
uz_latn: Mac klaviaturalarida F1–F12 media tugmalardir, agar «F1, F2 va hokazo tugmalardan standart funksional tugmalar sifatida foydalanish» yoqilmagan boʻlsa; fn bilan birga ular doim ishlaydi.

# hotkey.advice.rightOption
source: On some keyboard layouts right ⌥ types accented letters; those stop working while it is the dictation key.
ru: В некоторых раскладках правый ⌥ набирает буквы с диакритикой; пока он назначен клавишей диктовки, они перестанут работать.
uz_cyrl: Баъзи клавиатура тартибларида ўнг ⌥ диакритик ҳарфларни теради; у диктовка тугмаси бўлиб турганда бу ҳарфлар ишламайди.
uz_latn: Baʼzi klaviatura tartiblarida oʻng ⌥ diakritik harflarni teradi; u diktovka tugmasi boʻlib turganda bu harflar ishlamaydi.

# hotkey.advice.shift
source: ⇧ is held while typing capitals. A capital letter typed within 1.5 s of pressing ⇧ cancels the dictation it started.
ru: ⇧ удерживают при наборе заглавных букв. Заглавная буква, набранная в течение 1,5 с после нажатия ⇧, отменяет начатую им диктовку.
uz_cyrl: Бош ҳарфларни теришда ⇧ босиб турилади. ⇧ босилгандан кейин 1,5 сония ичида терилган бош ҳарф у бошлаган диктовкани бекор қилади.
uz_latn: Bosh harflarni terishda ⇧ bosib turiladi. ⇧ bosilgandan keyin 1,5 soniya ichida terilgan bosh harf u boshlagan diktovkani bekor qiladi.

# hotkey.detail
source: Works in every app, including full-screen ones. The text goes wherever your cursor is.
ru: Работает в любом приложении, в том числе в полноэкранном. Текст появляется там, где стоит курсор.
uz_cyrl: Ҳар қандай иловада, жумладан тўлиқ экранли иловаларда ҳам ишлайди. Матн курсор турган жойга ёзилади.
uz_latn: Har qanday ilovada, jumladan toʻliq ekranli ilovalarda ham ishlaydi. Matn kursor turgan joyga yoziladi.

# hotkey.headsUp
source: Heads up
ru: Обратите внимание
uz_cyrl: Эътибор беринг
uz_latn: Eʼtibor bering

# hotkey.hold
source: Hold %@
ru: Удерживайте %@
uz_cyrl: %@ тугмасини босиб туринг
uz_latn: %@ tugmasini bosib turing

# hotkey.presets
source: Presets
ru: Готовые варианты
uz_cyrl: Тайёр вариантлар
uz_latn: Tayyor variantlar

# hotkey.pressKey
source: Press the key you want
ru: Нажмите нужную клавишу
uz_cyrl: Керакли тугмани босинг
uz_latn: Kerakli tugmani bosing

# hotkey.record
source: Record new key
ru: Назначить новую клавишу
uz_cyrl: Янги тугма тайинлаш
uz_latn: Yangi tugma tayinlash

# hotkey.recording.detail
source: A single modifier — press and release it on its own, like right ⌥ — or a function key such as F13. Escape cancels.
ru: Одна клавиша-модификатор — нажмите и отпустите её отдельно, например правый ⌥, — или функциональная клавиша вроде F13. Esc — отмена.
uz_cyrl: Битта модификатор тугма — уни ёлғиз босиб, қўйиб юборинг, масалан ўнг ⌥ — ёки F13 каби функционал тугма. Esc — бекор қилиш.
uz_latn: Bitta modifikator tugma — uni yolgʻiz bosib, qoʻyib yuboring, masalan oʻng ⌥ — yoki F13 kabi funksional tugma. Esc — bekor qilish.

# hotkey.reject.combination
source: Combinations are not supported — hold a single key or a single modifier.
ru: Сочетания не поддерживаются — удерживайте одну клавишу или один модификатор.
uz_cyrl: Бирикмалар қўлланмайди — битта тугма ёки битта модификаторни босиб туринг.
uz_latn: Birikmalar qoʻllanmaydi — bitta tugma yoki bitta modifikatorni bosib turing.

# hotkey.reject.typingKey
source: %@ types text — holding it for Kotiba would stop it working everywhere. Pick a function key or a modifier.
ru: %@ печатает текст — если отдать её Kotiba, она перестанет работать везде. Выберите функциональную клавишу или модификатор.
uz_cyrl: %@ матн ёзади — уни Kotiba дастурига берсангиз, у ҳамма жойда ишламай қолади. Функционал тугма ёки модификаторни танланг.
uz_latn: %@ matn yozadi — uni Kotibaga bersangiz, u hamma joyda ishlamay qoladi. Funksional tugma yoki modifikatorni tanlang.

# hotkey.shortcuts
source: Shortcuts are not dictations
ru: Сочетания клавиш — не диктовка
uz_cyrl: Тугмалар бирикмаси — диктовка эмас
uz_latn: Tugmalar birikmasi — diktovka emas

# hotkey.shortcuts.detail
source: A key pressed within 1.5 s of the hotkey means you were typing a shortcut — right ⌘ then C is ⌘C — so that dictation is discarded and nothing is pasted. A key bumped later in a long dictation is let through and the dictation carries on.
ru: Клавиша, нажатая в течение 1,5 с после горячей клавиши, означает, что вы набирали сочетание — правый ⌘, а затем C — это ⌘C, — поэтому такая диктовка отбрасывается и ничего не вставляется. Клавиша, случайно задетая позже во время длинной диктовки, пропускается, и диктовка продолжается.
uz_cyrl: Тезкор тугмадан кейин 1,5 сония ичида босилган тугма сиз тугмалар бирикмасини тераётганингизни билдиради — ўнг ⌘, кейин C — бу ⌘C, — шунинг учун бундай диктовка бекор қилинади ва ҳеч нарса жойлаштирилмайди. Узун диктовка давомида кейинроқ тасодифан босилган тугма эса ўтказиб юборилади ва диктовка давом этади.
uz_latn: Tezkor tugmadan keyin 1,5 soniya ichida bosilgan tugma siz tugmalar birikmasini terayotganingizni bildiradi — oʻng ⌘, keyin C — bu ⌘C, — shuning uchun bunday diktovka bekor qilinadi va hech narsa joylashtirilmaydi. Uzun diktovka davomida keyinroq tasodifan bosilgan tugma esa oʻtkazib yuboriladi va diktovka davom etadi.

# hotkey.subtitle
source: Hold it to talk, let go to paste. As long as you hold, Kotiba listens.
ru: Удерживайте, чтобы говорить, отпустите, чтобы вставить текст. Пока клавиша нажата, Kotiba слушает.
uz_cyrl: Гапириш учун босиб туринг, матнни жойлаштириш учун қўйиб юборинг. Тугма босилиб турган экан, Kotiba тинглайди.
uz_latn: Gapirish uchun bosib turing, matnni joylashtirish uchun qoʻyib yuboring. Tugma bosilib turgan ekan, Kotiba tinglaydi.

# key.code
source: Key %lld
ru: Клавиша %lld
uz_cyrl: %lld-тугма
uz_latn: %lld-tugma

# key.escape
source: Escape
ru: Esc
uz_cyrl: Esc
uz_latn: Esc

# key.left
source: Left %@
ru: Левый %@
uz_cyrl: Чап %@
uz_latn: Chap %@

# key.right
source: Right %@
ru: Правый %@
uz_cyrl: Ўнг %@
uz_latn: Oʻng %@

# key.side.left
source: left
ru: левый
uz_cyrl: чап
uz_latn: chap

# key.side.right
source: right
ru: правый
uz_cyrl: ўнг
uz_latn: oʻng

# key.space
source: Space
ru: Пробел
uz_cyrl: Бўшлиқ
uz_latn: Boʻshliq

# languages.arabic.meanwhile
source: Until it downloads, a backup model answers Arabic.
ru: Пока она скачивается, арабский распознаёт запасная модель.
uz_cyrl: У юклангунча арабчани захира модел танийди.
uz_latn: U yuklanguncha arabchani zaxira model taniydi.

# languages.arabic.note
source: Modern Standard Arabic and the main dialects, with punctuation. Recognised on its own when it clearly sounds Arabic; pin Arabic when it is not.
ru: Современный стандартный арабский и основные диалекты, с пунктуацией. Определяется сам, когда речь явно звучит как арабская; иначе закрепите арабский.
uz_cyrl: Замонавий адабий араб тили ва асосий шевалар, тиниш белгилари билан. Нутқ аниқ арабча эшитилганда ўзи аниқланади; акс ҳолда араб тилини маҳкамланг.
uz_latn: Zamonaviy adabiy arab tili va asosiy shevalar, tinish belgilari bilan. Nutq aniq arabcha eshitilganda oʻzi aniqlanadi; aks holda arab tilini mahkamlang.

# languages.automatic.detail
source: Automatic: Kotiba works out which one you are speaking.
ru: Автоматически: Kotiba сама определяет, на каком языке вы говорите.
uz_cyrl: Автоматик: қайси тилда гапираётганингизни Kotiba ўзи аниқлайди.
uz_latn: Avtomatik: qaysi tilda gapirayotganingizni Kotiba oʻzi aniqlaydi.

# languages.checking
source: Checking…
ru: Проверяю…
uz_cyrl: Текширилмоқда…
uz_latn: Tekshirilmoqda…

# languages.detector.download
source: Download the detector (57 MB)
ru: Скачать определитель (57 МБ)
uz_cyrl: Аниқлагични юклаб олиш (57 МБ)
uz_latn: Aniqlagichni yuklab olish (57 MB)

# languages.engine.noModel
source: No model
ru: Нет модели
uz_cyrl: Модель йўқ
uz_latn: Model yoʻq

# languages.engine.off
source: Off
ru: Выключен
uz_cyrl: Ўчиқ
uz_latn: Oʻchiq

# languages.engine.problem
source: Problem
ru: Проблема
uz_cyrl: Муаммо
uz_latn: Muammo

# languages.english.downloadFailed
source: The download did not finish: %@. Apple’s recogniser answers English meanwhile — retry it below.
ru: Загрузка не завершилась: %@. Пока английский распознаёт движок Apple — повторите ниже.
uz_cyrl: Юклаш тугамади: %@. Ҳозирча инглиз тилини Apple двигатели танийди — қуйида қайта уриниб кўринг.
uz_latn: Yuklash tugamadi: %@. Hozircha ingliz tilini Apple dvigateli taniydi — quyida qayta urinib koʻring.

# languages.fallback
source: When it cannot tell
ru: Если не удаётся определить
uz_cyrl: Аниқлаб бўлмаса
uz_latn: Aniqlab boʻlmasa

# languages.lastOne
source: At least one language stays on.
ru: Хотя бы один язык остаётся включённым.
uz_cyrl: Камида битта тил ёқилган қолади.
uz_latn: Kamida bitta til yoqilgan qoladi.

# languages.model.download
source: Download %@
ru: Скачать %@
uz_cyrl: Юклаб олиш: %@
uz_latn: Yuklab olish: %@

# languages.model.gone
source: The file is gone
ru: Файл исчез
uz_cyrl: Файл йўқ
uz_latn: Fayl yoʻq

# languages.models.onDisk
source: %@ on disk
ru: %@ на диске
uz_cyrl: Дискда %@
uz_latn: Diskda %@

# languages.models.title
source: Models on this Mac
ru: Модели на этом Mac
uz_cyrl: Шу Mac компьютеридаги моделлар
uz_latn: Shu Mac kompyuteridagi modellar

# languages.needs.both
source: Needs an Uzbek model and the language detector
ru: Нужны узбекская модель и определитель языка
uz_cyrl: Ўзбек тили модели ва тил аниқлагич керак
uz_latn: Oʻzbek tili modeli va til aniqlagich kerak

# languages.needs.detector
source: Needs the language detector
ru: Нужен определитель языка
uz_cyrl: Тил аниқлагич керак
uz_latn: Til aniqlagich kerak

# languages.needs.uzbek
source: Needs an Uzbek model
ru: Нужна узбекская модель
uz_cyrl: Ўзбек тили модели керак
uz_latn: Oʻzbek tili modeli kerak

# languages.off.note
source: Turned off: never used for dictation and not kept in memory.
ru: Выключен: не используется для диктовки и не занимает память.
uz_cyrl: Ўчирилган: диктовкада ишлатилмайди ва хотирани банд қилмайди.
uz_latn: Oʻchirilgan: diktovkada ishlatilmaydi va xotirani band qilmaydi.

# languages.optional.downloading
source: Downloading — %@
ru: Загрузка — %@
uz_cyrl: Юкланмоқда — %@
uz_latn: Yuklanmoqda — %@

# languages.optional.sizeOff
source: Turning it on downloads %@
ru: При включении скачается %@
uz_cyrl: Ёқилганда %@ юклаб олинади
uz_latn: Yoqilganda %@ yuklab olinadi

# languages.optional.sizeOn
source: %@ to download
ru: Нужно скачать %@
uz_cyrl: %@ юклаб олинади
uz_latn: %@ yuklab olinadi

# languages.pinned.detail
source: Pinned: every dictation is %@ until you choose Automatic. Instant — no detection at all.
ru: Закреплено: каждая диктовка распознаётся как «%@», пока вы не выберете «Автоматически». Мгновенно — без определения языка.
uz_cyrl: Маҳкамланган: «Автоматик»ни танламагунингизча ҳар бир диктовка «%@» деб қабул қилинади. Бир зумда — тилни аниқлашсиз.
uz_latn: Mahkamlangan: «Avtomatik»ni tanlamaguningizcha har bir diktovka «%@» deb qabul qilinadi. Bir zumda — tilni aniqlashsiz.

# languages.remove
source: Remove model files (%@)
ru: Удалить файлы модели (%@)
uz_cyrl: Модел файлларини ўчириш (%@)
uz_latn: Model fayllarini oʻchirish (%@)

# languages.remove.confirm
source: Remove %@ from this Mac? Turn the language back on to download it again.
ru: Удалить %@ с этого Mac? Чтобы скачать снова, включите язык.
uz_cyrl: %@ шу Mac компьютеридан ўчирилсинми? Қайта юклаб олиш учун тилни яна ёқинг.
uz_latn: %@ shu Mac kompyuteridan oʻchirilsinmi? Qayta yuklab olish uchun tilni yana yoqing.

# languages.russian.note
source: Same model as English, part of the first download. Until it has landed, Russian waits for it.
ru: Та же модель, что и для английского, — часть первой загрузки. Пока она не скачана, русский ждёт её.
uz_cyrl: Инглизча билан бир хил модел, биринчи юкланма таркибида. У юкланмагунча рус тили кутади.
uz_latn: Inglizcha bilan bir xil model, birinchi yuklanma tarkibida. U yuklanmaguncha rus tili kutadi.

# languages.subtitle
source: English, Russian and Uzbek, all transcribed on this Mac. Nothing you say leaves it to be turned into text.
ru: Английский, русский и узбекский — всё распознаётся на этом Mac. Ничего из сказанного не покидает его ради превращения в текст.
uz_cyrl: Инглиз, рус ва ўзбек тиллари — ҳаммаси шу Mac компьютерида матнга айлантирилади. Айтганларингиз бунинг учун ҳеч қаерга юборилмайди.
uz_latn: Ingliz, rus va oʻzbek tillari — hammasi shu Mac kompyuterida matnga aylantiriladi. Aytganlaringiz buning uchun hech qayerga yuborilmaydi.

# languages.turkish.note
source: Downloaded when Turkish is turned on. Recognised by itself in longer dictations; for short ones, choose Turkish above.
ru: Скачивается при включении турецкого. В длинных диктовках распознаётся сам; для коротких выберите турецкий выше.
uz_cyrl: Турк тили ёқилганда юклаб олинади. Узун диктовкаларда ўзи аниқланади; қисқалари учун юқорида турк тилини танланг.
uz_latn: Turk tili yoqilganda yuklab olinadi. Uzun diktovkalarda oʻzi aniqlanadi; qisqalari uchun yuqorida turk tilini tanlang.

# languages.uzbek.note
source: Kotiba’s Uzbek model, running entirely on this Mac.
ru: Узбекская модель Kotiba, работает полностью на этом Mac.
uz_cyrl: Kotiba дастурининг ўзбек модели, тўлиқ шу Mac компьютерида ишлайди.
uz_latn: Kotibaning oʻzbek modeli, toʻliq shu Mac kompyuterida ishlaydi.

# languages.which
source: Which language
ru: Какой язык
uz_cyrl: Қайси тил
uz_latn: Qaysi til

# languages.whisper.accuracy
source: Accuracy
ru: Точность
uz_cyrl: Аниқлик
uz_latn: Aniqlik

# languages.whisper.accuracy.detail
source: Careful is a little more accurate and a little slower.
ru: Тщательный режим чуть точнее, но немного медленнее.
uz_cyrl: Пухта режим бироз аниқроқ, лекин бироз секинроқ.
uz_latn: Puxta rejim biroz aniqroq, lekin biroz sekinroq.

# languages.whisper.careful
source: Careful
ru: Тщательно
uz_cyrl: Пухта
uz_latn: Puxta

# languages.whisper.fast
source: Fast
ru: Быстро
uz_cyrl: Тез
uz_latn: Tez

# languages.whisper.gpu
source: Use the GPU
ru: Использовать GPU
uz_cyrl: GPU’дан фойдаланиш
uz_latn: GPU’dan foydalanish

# languages.whisper.hour
source: 1 hour
ru: 1 час
uz_cyrl: 1 соат
uz_latn: 1 soat

# languages.whisper.minutes
source: %lld minutes
ru: %lld минуты
uz_cyrl: %lld дақиқа
uz_latn: %lld daqiqa

# languages.whisper.never
source: Never
ru: Никогда
uz_cyrl: Ҳеч қачон
uz_latn: Hech qachon

# languages.whisper.notResident
source: Not in memory now.
ru: Сейчас не в памяти.
uz_cyrl: Ҳозир хотирада эмас.
uz_latn: Hozir xotirada emas.

# languages.whisper.preload
source: Load every language up front
ru: Загружать все языки заранее
uz_cyrl: Барча тилларни олдиндан юклаш
uz_latn: Barcha tillarni oldindan yuklash

# languages.whisper.preload.detail
source: Off, Kotiba keeps only your main language ready and loads another as you start speaking. On, every language you use stays ready, using more memory.
ru: Выключено: Kotiba держит наготове только основной язык и загружает другой, как только вы начинаете говорить. Включено: наготове все ваши языки, но памяти уходит больше.
uz_cyrl: Ўчиқ: Kotiba фақат асосий тилингизни тайёр тутади, бошқасини гапира бошлаганингизда юклайди. Ёқилган: барча тилларингиз тайёр туради, лекин хотира кўпроқ кетади.
uz_latn: Oʻchiq: Kotiba faqat asosiy tilingizni tayyor tutadi, boshqasini gapira boshlaganingizda yuklaydi. Yoqilgan: barcha tillaringiz tayyor turadi, lekin xotira koʻproq ketadi.

# languages.whisper.release
source: Release models after
ru: Выгружать модели через
uz_cyrl: Моделларни бўшатиш вақти
uz_latn: Modellarni boʻshatish vaqti

# languages.whisper.release.detail
source: Unused this long, the speech models are let go to free memory. They load again as you start speaking.
ru: Если модели речи не используются столько времени, они выгружаются, чтобы освободить память. Они загрузятся снова, как только вы заговорите.
uz_cyrl: Шунча вақт ишлатилмаса, нутқ моделлари хотирани бўшатиш учун ёпилади. Гапира бошлаганингизда яна юкланади.
uz_latn: Shuncha vaqt ishlatilmasa, nutq modellari xotirani boʻshatish uchun yopiladi. Gapira boshlaganingizda yana yuklanadi.
